app/Validation/UserRules.php

    public function validateUser(String $str, String $fields, array $data)
    {
        $model = new M_User();
        $user = $model->where('users_nickname', $data['users_nickname'])
            ->first();
---
SELECT *
FROM `php_users`
WHERE `users_nickname` = 'administrateur'
 LIMIT 1