app/Controllers/C_User.php

SELECT *
FROM `php_users`
WHERE `users_nickname` = 'administrateur'
 LIMIT 1
---
    public function login()
    {
        $data = [];
        helper(['form']);

        if ($this->request->getMethod() == 'post') {
            $rules = [
                'users_nickname' => 'required|min_length[6]|max_length[80]',
                'users_password' => 'required|min_length[8]|max_length[255]|validateUser[users_nickname,users_password]',
            ];

            $errors = [
                'users_password' => [
                    'validateUser' => 'Pseudonyme  ou mot de passe renseigné incorrect'
                ]
            ];



            if (!$this->validate($rules, $errors)) {
                $data['validation'] = $this->validator;
            } else {
                // user session
                $modelUser = new M_User();
                $user = $modelUser->where('users_nickname', $this->request->getVar('users_nickname'))
                    ->first();